
## Plan Result (terraform/aws/openhands)

[CI link](https://github.com/boxp/arch/actions/runs/13850100339)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ecr_lifecycle_policy.openhands_runtime_lifecycle
  * aws_ecr_repository.openhands_runtime


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecr_lifecycle_policy.openhands_runtime_lifecycle will be created
  + resource "aws_ecr_lifecycle_policy" "openhands_runtime_lifecycle" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "limit the number of images to 3"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "openhands-runtime"
    }

  # aws_ecr_repository.openhands_runtime will be created
  + resource "aws_ecr_repository" "openhands_runtime" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "openhands-runtime"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":2994,"Program":"tfcmt","SHA1":"3de08c92e16626a1d6dccd39e9b7196ee3538c5b","Target":"terraform/aws/openhands","Vars":{},"WorkflowName":"pull_request_target"} -->